/* Cancel按钮 */
"kAlertBtnCancel" = "Cancel";

/* 关闭按钮 */
"kAlertBtnClose" = "Close";

/* OK按钮 */
"kAlertBtnOK" = "OK";

/* Retry按钮 */
"kAlertBtnRetry" = "Retry";

/* Settings按钮 */
"kAlertBtnSettings" = "Settings";

/* 升级按钮 */
"kAlertBtnUpgrade" = "Upgrade";

/* 查看按钮 */
"kAlertBtnView" = "View";

/* xx即将到达，xx is coming. */
//"kAlertFrmStringArrived" = "%@ is coming.";
"kAlertFrmStringArrived" = "%@";

/* xx已经离开，Leave xx */
"kAlertFrmStringLeaved" = "%@";

/* 需要打开internet连接访问地图的提示框的内容 */
"kAlertNeedInternetBodyAccessMaps" = "You must connect to a Wi-Fi or cellular data network to access maps data.";

/* 需要打开internet连接访问地图的提示框的标题 */
"kAlertNeedInternetTitleAccessMaps" = "Cannot Get Maps Data";

/* 需要打开internet连接访问App store的提示框的内容 */
"kAlertNeedInternetBodyAccessAppStore" = "You must connect to a Wi-Fi or cellular data network to access the App Store.";

/* 需要打开internet连接访问App store的提示框的标题 */
"kAlertNeedInternetTitleAccessAppStore" = "Cannot Connect to the App Store";

/* 打开定位服务的提示框的消息内容 */
"kAlertNeedLocationServicesBody" = "You must turn on “Location Services” to allow the application to determine your location.";

/* 打开定位服务的提示框的消息标题 */
"kAlertNeedLocationServicesTitle" = "Cannot Get Current Location";

/* 升级为pro版本的提示框的消息内容 */
"kAlertUpgradeProVesionBody" = "You must upgrade the application to full version to increase more iAlarm.";

/* 升级为pro版本的提示框的消息标题 */
"kAlertUpgradeProVesionTitle" = "Upgrade to Full Version";


/* 查询失败的提示框内容：请重试。Please try again.（错误的默认提示） */
"kAlertSearchBodyTryAgain" = "Please try again.";

/* 查询失败的提示框内容：Please try tomorrow.对应“一天内查询次数过多” */
"kAlertSearchBodyTryTomorrow" = "Please try tomorrow.";

/* 查询提示框标题，Search */
"kAlertSearchTitle" = "Search";

/* 地址查询失败的提示框标题：发生网络错误，Network Error，（错误的默认提示） */
"kAlertSearchTitleDefaultError" = "Network Error";

/* 地址查询失败的提示框标题：无结果，No Results Found */
"kAlertSearchTitleNoResults" = "No Results Found";

/* 查询完成，有多个结果提示用户选择，Did you mean... */
"kAlertSearchTitleResults" = "Did you mean...";

/* 地址查询失败的提示框标题：一天内查询次数过多，Too Many Queries have been Made */
"kAlertSearchTitleTooManyQueries" = "Too Many Queries have been Made";

/* 购买的消息标题 */
"kAlertPurchaseTitle" = "Purchase";
/* 需要打开允许购买选项的消息标题 */
"kAlertPurchasenNotAllowPurchaseBody" = "You do not have In-App Purchases enabled.";

/* 东经格式化串 */
"kCoordinateFrmStringEastLongitude" = "%d°%d′%d″E";

/* 东经格式化串(值与符号间有空格) */
"kCoordinateFrmStringEastLongitudeSpace" = "%d°%d′%d″ E";

/* 东经格式化串(秒上带小数) */
"kCoordinateFrmStringEastLongitudeDecimal" = "%3d°%2d′%2d.%.2d″ E";


/* 北纬格式化串 */
"kCoordinateFrmStringNorthLatitude" = "%d°%d′%d″N";

/* 北纬格式化串(值与符号间有空格) */
"kCoordinateFrmStringNorthLatitudeSpace" = "%d°%d′%d″ N";

/* 北纬格式化串(秒上带小数) */
"kCoordinateFrmStringNorthLatitudeDecimal" = "%3d°%2d′%2d.%.2d″ N";


/* 南纬格式化串 */
"kCoordinateFrmStringSouthLatitude" = "%d°%d′%d″S";

/* 南纬格式化串(值与符号间有空格) */
"kCoordinateFrmStringSouthLatitudeSpace" = "%d°%d′%d″ S";

/* 南纬格式化串(秒上带小数) */
"kCoordinateFrmStringSouthLatitudeDecimal" = "%3d°%2d′%2d.%.2d″ S";


/* 西经格式化串 */
"kCoordinateFrmStringWestLongitude" = "%d°%d′%d″W";

/* 西经格式化串(值与符号间有空格) */
"kCoordinateFrmStringWestLongitudeSpace" = "%d°%d′%d″ W";

/* 西经格式化串(秒上带小数) */
"kCoordinateFrmStringWestLongitudeDecimal" = "%3d°%2d′%2d.%.2d″ W";


/* 默认的位置闹钟名称 */
"KDefaultAlarmName" = "iAlarm";

/* 警示半径类型名称-001，Near */
"KDicAlarmRadius001" = "Near";

/* 警示半径类型名称-002，Standard */
"KDicAlarmRadius002" = "Standard";

/* 警示半径类型名称-003，Far */
"KDicAlarmRadius003" = "Far";

/* 警示半径类型名称-004，Custom */
"KDicAlarmRadius004" = "Custom";

/* 混合地图类型名称 */
"KDicMapTypeNameHybrid" = "Hybrid";

/* 卫星地图类型名称 */
"KDicMapTypeNameSatellite" = "Satellite";

/* 标准地图类型名称 */
"KDicMapTypeNameStandard" = "Map";

/* 开关值已经关闭 */
"KDicOff" = "Off";

/* 开关值已经打开 */
"KDicOn" = "On";

/* 重复类型的名称-001，Once */
"KDicRepeateTypeName001" = "Once";

/* 重复类型的名称-002，Forever*/
"KDicRepeateTypeName002" = "Always";

/* 闹钟铃声名称-无 */
"KDicSoundName000" = "None";

/* 闹钟铃声名称-001 */
"KDicSoundName001" = "Marimba";

/* 闹钟铃声名称-002 */
"KDicSoundName002" = "Xylophone";

/* 闹钟铃声名称-003 */
"KDicSoundName003" = "Harp";

/* 闹钟铃声名称-004 */
"KDicSoundName004" = "Old Phone";

/* 闹钟铃声名称-005 */
"KDicSoundName005" = "Trill";

/* 闹钟铃声名称-006 */
"KDicSoundName006" = "KDicSoundName006";

/* 闹钟铃声名称-007 */
"KDicSoundName007" = "KDicSoundName007";

/* 闹钟铃声名称-008 */
"KDicSoundName008" = "KDicSoundName008";

/* 闹钟铃声名称-009 */
"KDicSoundName009" = "KDicSoundName009";

/* 闹钟铃声名称-010 */
"KDicSoundName010" = "KDicSoundName010";

/* 闹钟铃声名称-011 */
"KDicSoundName011" = "KDicSoundName011";

/* 闹钟铃声名称-012 */
"KDicSoundName012" = "KDicSoundName012";

/* 闹钟铃声名称-013 */
"KDicSoundName013" = "KDicSoundName013";

/* 闹钟铃声名称-014 */
"KDicSoundName014" = "KDicSoundName014";

/* 闹钟铃声名称-015 */
"KDicSoundName015" = "KDicSoundName015";

/* 闹钟铃声名称-016 */
"KDicSoundName016" = "KDicSoundName016";

/* 触发条件类型的名称，When I Arrive */
"kDicTriggerTypeNameWhenArrive" = "When I Arrive";       

/* 触发条件类型的名称，When I Leave */
"kDicTriggerTypeNameWhenLeave" = "When I Leave";

/* Alarm是否启用的标签 */
"KLabelAlarmEnable" = "Enabled";

/* 信息卡视图地址的标签（英文小写） */
"KLabelAlarmMapInfo" = "address";

/* 闹钟名字的标签 */
"KLabelAlarmName" = "Label";

/* 地址的标签 */
"KLabelAlarmPostion" = "Destination";

/* 警示半径的标签 */
"KLabelAlarmRadius" = "Alarm Radius";

/* 重复类型的标签 */
"KLabelAlarmRepeat" = "Repeat";

/* 声音的标签 */
"KLabelAlarmSound" = "Sound";

/* 振动的标签 */
"KLabelAlarmVibrate" = "Vibrate";

/* 触发警告条件的标签 */
"KLabelAlarmTrigger" = "Alarm";

/* 地图书签视图的提示文本 */
"KLabelMapBookmarksView" = "Choose a iAlarm to view on the map";

/* 新增闹钟的大头针的标题 */
"KLabelMapNewAnnotationTitle" = "Drag the Pin to Change Destination";

/* 关于tab的标题 */
"KTabTitleAbout" = "About";

/* 闹钟列表tab标题 */
"KTabTitleAlarmList" = "iAlarm List";

/* 闹钟地图tab标题 */
"KTabTitleAlarmMaps" = "iAlarm Maps";

/* 设置tab的标题 */
"KTabTitleSetting" = "Setting";

/* 提示无法反转地址，需要打开internet连接的提示文本 */
"KTextPromptNeedInternetToReversing" = "You must connect to a Wi-Fi or cellular data network to reverse the geographical coordinate to address information.";

/* 提示无法取得当前位置，需要通过地图指定位置的提示文本 */
"KTextPromptNeedSetLocationByMaps" = "Cannot determine current location. Please set the destination using the map";

/* 空闹钟列表的背景文字 */
"KTextPromptNoiAlarms" = "No iAlarms";

/* 正在定位的提示文本 */
"KTextPromptWhenLocating" = "Current Location...";

/* 正在反转地址的提示文本 */
"KTextPromptWhenReversing" = "Reversing Coordinate...";

/* 正在载入的提示文本 */
"KTextPromptWhenLoading" = "Loading Maps...";

/* 当前位置的文本 */
"KTextPromptDistanceCurrentLocation" = "%.1f km" ;//"%.1f km away";//"Distance to Current Location:%.1fkm";

/* 当前位置的文本 */
"KTextPromptCurrentLocation" = "Current Location";

/* 这是当前位置的文本 */
"KTextPromptItIsCurrentLocation" = "This is Current Location.";

/* 搜索bar的Placeholder */
"KTextPromptPlaceholderOfSearchBar" = "Search or Destination";


/* 千米(单数) */
"kUnitKilometre" = "km";

/* 米(单数) */
"kUnitMeter" = "m";

/* 米(复数) */
"kUnitMeters" = "m";

/* 添加闹钟视图标题 */
"KViewTitleAddAlarms" = "Add iAlarm";

/* 编辑地址的视图标题 */
"KViewTitleAlarmPostion" = "Destination";

/* 编辑警示半径视图标题 */
"KViewTitleAlarmRadius" = "Alarm Radius";

/* 闹钟列表视图标题 */
"KViewTitleAlarmsList" = "iAlarm List";

/* 闹钟地图视图标题 */
"KViewTitleAlarmsListMaps" = "iAlarm Maps";

/* 编辑闹钟视图标题 */
"KViewTitleEditAlarms" = "Edit iAlarm";

/* 信息卡视图标题 */
"KViewTitleInformation" = "Info";

/* 地图书签视图的标题 */
"KViewTitleMapBookmarks" = "iAlarms";

/* 编辑名称视图标题 */
"KViewTitleName" = "Label";

/* 编辑重复类型视图标题 */
"KViewTitleRepeat" = "Repeat";

/* 编辑铃声视图标题 */
"KViewTitleSound" = "Sound";

/* 编辑振动视图标题 */
"KViewTitleVibrate" = "Vibrate";

/* 触发警告条件视图的标题 */
"KViewTitleTrigger" = "Alarm";

///////////////////////////////////////////////////////////////////

/* 名字的提示文本 */
"KAPTextPlaceholderName" = "E.g., Where you are approaching to";

/* 备注的提示文本 */
"KAPTextPlaceholderNote" = "E.g., What do you need to do upon arriving";

/* 开始 */
"KAPTitleBeginTime" = "Starts";

/* 结束 */
"KAPTitleEndTime" = "Ends";

/* 备注 */
"KAPTitleNote" = "Note";

/* 定时启动 */
"KAPTitleTimeSwitch" = "Timer";

/* 使用相同的开始与结束 */
"KAPTitleSameBeginEndTime" = "Use the same Starts-Ends";

/* 开始结束 */
"KAPTitleBeginTimeAndEndTime" = "Start & End";

/* 最近搜索 */
"KBMTitleBMRecents" = "Recents";

/* 通讯录 */
"KBMTitleContacts" = "Contacts";

/* 联系人 */
"KBMTitleContact" = "Contact";

/* 选取联系人显示在地图上 */
"KBMTitlePromptContacts" = "Choose a contact to view on the map";

/* 选取最近的搜索 */
"KBMTitlePromptRecents" = "Choose a recent search";

/* 现在 */
"KTITitleNow" = "now";

/* x天前 */
"KTITitleXDAgo" = "%dd ago";

/* x小时前 */
"KTITitleXHAgo" = "%dh ago";

/* x分钟前 */
"KTITitleXMAgo" = "%dm ago";

/* 每天 */
"KWDSTitleEveryDay" = "Every day";

/* 工作日 */
"KWDSTitleWeekdays" = "Weekdays";

/* 周末 */
"KWDSTitleWeekends" = "Weekends";

/* 次日 */
"KWDSTitleNextDay" = "Next Day";

/* 每周五 */
"KWDTitleEveryFriday" = "Every Friday";

/* 每周一 */
"KWDTitleEveryMonday" = "Every Monday";

/* 每周六 */
"KWDTitleEverySaturday" = "Every Saturday";

/* 每周日 */
"KWDTitleEverySunday" = "Every Sunday";

/* 每周四 */
"KWDTitleEveryThursday" = "Every Thursday";

/* 每周二 */
"KWDTitleEveryTuesday" = "Every Tuesday";

/* 每周三 */
"KWDTitleEveryWednesday" = "Every Wednesday";

/* 过X分钟提醒 */
"kTitleAlarmAfterXMinutes" = "Remind %d min later";

/* "过一会再提醒" */
"kTitleAlarmLater" = "Remind later";

/* 清除 */
"KTitleClear" = "Clear";

/* 取消 */
"KTitleCancel" = "Cancel";

/* 搜索 */
"KTitleSearch" = "Search";

/* 告诉朋友 */
"kTitleTellFriends" = "Tell A Friend";

/* 清除所有最近搜索 */
"KTitleClearAllRecents" = "Clear All Recents";

/* 测试 */
"KTitleTest" = "Test";

/* 启动 */
"KTitleLaunch" = "Launch";

/* 距离当前位置:少于0.1公里 */
"KTextDistanceLessThan0_1Km" = "Less than 0.1 km";

/* 下一次提醒的警告 */
"KTextWaringNexttimeAlarm" = "As you are very near to this destination, it will remind you next time when you enter the area of the destination!";

/* 闹钟半径太小的警告 */
"KTextWaringRadiusTooSmall" = "the Alarm radius is too small, you may miss the reminder. Do not set a Alarm radius like that, unless you can enssure your iPhone can receive GPS satellite signals without being kept out.";

/* 为什么要实用定时启动的描述 */
"KTextWhyTimeSwitch" = "You can save the battery power with \"Timer\". Your iPhone will receive a notification requiring you to launch iAlarm at the Starting Time.";

/* 启动位置闹钟的通知 */
"KTextNotificationLaunchAlarm" = "Tap to launch";

/* 已启动！ */
"KTextAlarmHasLaunched" = "The iAlarm is launched!";

/* 不能自动启动的原因 */
"KTextWhyCanNotAutoLaunch" = "Due to the limit of iOS system, you need to tap the notification to launch iAlarm.";

